package exampleLab9.example_2;
/*
Создать приложение с использованием рекурсии для перевода целого числа,
введенного с клавиатуры, в двоичную систему счисления.
 */

public class Main {
    public static void main(String[] args) {
        System.out.println(BitRecursion.BitRec(10));
    }
}
